Revit 2024 API
BuiltInFailures.ScheduleViewFailures.ColumnsExceedSegment Property
 Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds. You can add levels or adjust the view parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ColumnsExceedSegment { get; }
Visual Basic
Public Shared ReadOnly Property ColumnsExceedSegment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ColumnsExceedSegment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace